a=input('Здравствуйте! Как Вас зовут? ')
print('Очень приятно,',a+'!','Меня зовут Марк.')
b=int(input('Сколько Вам лет?'))
if b<78:
    print('Да,',a,'я старше вас на',78-b,'лет')
elif b>78:
    print('Да,', a, 'Вы старше мена на',b-78, 'лет')
else:
    print('Да,',a,'мы с вами одного возраста')
c=input('Вам нравится программировать? ').lower()
if c=='да':
    print('Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.')
else:
    print('Жаль. Я думал, Вы сможете написать интересную программу для меня.')
