v=input('Собака короткошерстной породы?')
if v=='да':
    s=input('Рост собаки менее 50 см?')
    if s=='да':
        d=input('У собаки короткий хвост?')
        if d=='да':
            print('английский бульдог')
        elif d=='нет':
            g=input('У собаки длинные уши?')
            if g=='да':
                print('гончая')
            elif g=='нет':
                e=input('У собаки короткое тело?')
                if e=='да':
                    print('мопс')
                elif e=='нет':
                    print('чихуахуа')
    elif s=='нет':
        i=input('Собака весит более 50кг?')
        if i=='да':
            print('датский дог')
        else:
            print('фоксхаунд')
elif v=='нет':
    p=input('Рост собаки менее 50 см?')
    if p=='да':
        z=input('У собаки доброжелательный характер?')
        if z=='да':
            print('кокер-спаниэль')
        elif z=='нет':
            print('ирландский сеттер')
    elif p=='нет':
        k=input('У собаки рост менее 70 см?')
        if k=='да':
            t=input('У собаки длинные уши?')
            if t=='да':
                print('бoльшой вандейский грифон')
            elif t=='нет':
                print('колли')
        elif k=='нет':
            n=input('Окрас рыжий с белыми отметинами?')
            if n=='да':
                print('сенбернар')
            elif n=='нет':
                m=input('Белоснежный окрас?')
                if m=='да':
                    print('ирландский волкодав')
                else:
                    print('ньюфаундленд')




